#+AUTHOR: Daniel Saldivar
#+TITLE: GNU Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./config.el :mkdirp yes


** Change heading icons
#+BEGIN_SRC emacs-lisp
    (setq python-shell-interpreter "/opt/homebrew/bin/python3")

  (use-package org-superstar
      :ensure t
      :config
      (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
      (setq org-superstar-headline-bullets-list '("◉" "○" "✸" "✿" "❀" "✼" "✻" "✤"))
      (setq org-hide-leading-stars t)
      (setq org-superstar-special-todo-items t)

            (setq org-agenda-files '("~/org/gtd/inbox.org"
                         "~/org/gtd/tickler.org"
                         "~/org/gtd/gtd.org"
                         "~/org/holidays.org"
                         "~/org/birthdays.org")) ;; this will set all the files that will appear in your agenda
       (setq org-ellipsis " ▾")
       (setq org-hide-emphasis-markers t)
       (setq org-confirm-babel-evaluate nil)



         ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;;;;;;;;;;;;;;;;;; START org-capture ;;;;;;;;;;;;;;;;;;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (setq org-capture-templates '(("t" "Todo [inbox]" entry
                                   (file+headline "~/org/gtd/inbox.org" "Tasks")
                                   "* TODO %i   %?")
                                  ("T" "Tickler" entry
                                   (file+headline "~/org/gtd/tickler.org" "Tickler")
                                   "* %i%? \n %U")
                                  ("j" "Journal" entry
                                   (file+olp+datetree "~/org/journal.org")
                                   "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
                                   :clock-in :clock-resume
                                   :empty-lines 1)

                                  ("c" "Contacts")
                                  ("cp" "Personal Contacts" entry
                                   (file+headline "~/org/contacts.org" "Personal")
                                  "* %(org-contacts-template-name) 
  :PROPERTIES: 
  :EMAIL: 
  :PHONE: 
  :ADDRESS: 
  :BIRTHDAY: %^{YYYY-MM-DD}
  :NOTE: 
  :END:\n" :kill-buffer t)

                                  ("cc" "Professional Contacts" entry
                                   (file+headline "~/org/contacts.org" "Contacts")
                                   "* %(org-contacts-template-name)
  "
                                   )
                                  ("m" "Metrics Capture")
                                  ("mw" "Weight" table-line (file+headline "~/org/metrics.org" "Weight")
                                   "| %U %^{Weight} | %^{Notes} |" :kill-buffer t)
                                  ))

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
      ;;;;;;;;;;;;;;;;;;; Start org-refile ;;;;;;;;;;;;;;;;;;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
              (setq org-refile-targets
                '(("~/org/gtd/archive.org" :maxlevel . 1)
                  ("~/org/gtd/gtd.org" :maxlevel . 1)))

              ;; Save Org buffers after refiling!
              (advice-add 'org-refile :after 'org-save-all-org-buffers)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
      ;;;;;;;;;;;;;;;;;;; END org-refile ;;;;;;;;;;;;;;;;;;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;;;;;;;;;;;;;;;;;; END org-capture ;;;;;;;;;;;;;;;;;;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


            (setq org-todo-keywords
    '(
      (sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
      (sequence "AREA(a)" "NEXT(n)" "|" "Archive(!)")
      (sequence "PROJ(p)" "ACTIVE(a)"  "WAIT(w@/!)" "|" "COMPLETED(c)" "CANC(k@)")))
      )


              (push '("conf-unix" . conf-unix) org-src-lang-modes)


#+END_SRC

#+RESULTS:
: ((conf-unix . conf-unix) (conf-unix . conf-unix) (C . c) (C++ . c++) (asymptote . asy) (bash . sh) (beamer . latex) (calc . fundamental) (cpp . c++) (ditaa . artist) (dot . fundamental) (elisp . emacs-lisp) (ocaml . tuareg) (screen . shell-script) (shell . sh) (sqlite . sql))

